// ========================================
// 必須バリデーション
// =========================================
export const required = (value: string) => !!value || '必ず入力してください'

// ========================================
// テキストの長さのバリデーション
// =========================================
export const textLength = (min: number, max: number) => (value: string) =>
  (value.length >= min && value.length <= max) ||
  `${min}文字以上${max}文字以下で入力してください`

// ========================================
// ファイルサイズのバリデーション
// =========================================
export const fileSize = (value: File) => {
  return (
    !value ||
    value.size <= 1677721 ||
    'ファイルのサイズが許容サイズを超えています'
  )
}

// ========================================
// ファイルタイプのバリデーション
// =========================================
export const fileType = (value: File) => {
  const regex = /^image/

  return !value || regex.test(value.type) || '画像ファイルではありません'
}
